DICTIONARY = {
    'ru': {
        'mainmenu_msg': 'Главное меню',

        'my_events_btn': '🔹 Мои события 🔹',
        'settings_btn': 'Настройки ⚙️',
        'settings_categories_btn': 'Категории️',
        'settings_city_btn': 'Город️',

        'add_btn': 'Добавить',

        'submit_btn': '✅ Подтвердить',
        'discard_order_btn': '❌ Отмена',


        'skip_btn': 'Пропустить',
        'back_button': '↩️ Назад',
        'no_button': 'Воспользуйтесь, пожалуйста, клавиатурой',

        'welcome_msg': "Привет, {0}!\nЯ помогу тебе стать специалистом в направлении, которое тебе интересно. "
                       "Ты всегда будешь в курсе новых обучающих онлайн событий.",

    },
}