DICTIONARY = {
    'ru': {
        'mainmenu_msg': 'Главное меню',

        'my_events_btn': '🔹 Мои события 🔹',
        'settings_btn': 'Настройки ⚙️',
        'settings_menu_msg': 'Здесь ты можешь изменить свой город и подписки на категории',
        'settings_categories_btn': 'Категории️',
        'settings_city_btn': 'Город️',

        'get_events_btn': 'Список событий',

        'welcome_msg': "Привет, {0}!\nЯ помогу тебе стать специалистом в направлении, которое тебе интересно. "
                       "Ты всегда будешь в курсе новых обучающих онлайн событий.",
        'set_lang_msg': "Выбери язык:",
        'set_city_msg': "Если не боишься коронавируса, кроме онлайн событий, можешь отслеживать курсы офлайн "
                        "в твоем городе. Введи свой город или нажми Пропустить",
        'signed_up_msg': "🚀 Всё готово! Когда появится подходящее для тебя мероприятие, я обязательно сообщу.\n"
                         "Чтобы подписаться на событие, нажми кнопку с его номером.",


        'done_btn': "Готово",
        'skip_btn': 'Пропустить',
        'back_btn': '↩️ Назад',
        'no_button': 'Воспользуйтесь, пожалуйста, клавиатурой',
        'submit_btn': '✅ Подтвердить',
        'discard_order_btn': '❌ Отмена',
    },
    'ua': {
        'mainmenu_msg': 'Головне меню',

        'my_events_btn': '🔹 Мої події 🔹',
        'settings_btn': 'Налаштування ⚙️',
        'settings_menu_msg': 'Тут ти можеш змінити своє місто і підписки на категорії',
        'settings_categories_btn': 'Категорії️',
        'settings_city_btn': 'Місто',

        'get_events_btn': 'Список подій',

        'welcome_msg': "Привіт, {0}!\nЯ допоможу тобі стати спеціалістом в сферах, що тебе цікавлять. "
                       "Ти завжди будеш в курсі нових навчальних та професійних подій.",
        'set_lang_msg': "Обери мову:",
        'set_city_msg': "Якщо не боїшся Covid-19, тоді можеш відстежувати і офлайн події у своєму місті."
                        "Введи назву свого міста або натисни Пропустити",
        'signed_up_msg': "🚀 Все готово! Тепер я сповіщатиму тебе про усі події, що можуть тебе зацікавити.\n"
                         "Щоб підписатися на подію, натисни кнопку з його номером.",


        'done_btn': "Готово",
        'skip_btn': 'Пропустити',
        'back_btn': '↩️ Назад',
        'no_button': 'Використовуйте клавіатуру, будь-ласка',
        'submit_btn': '✅ Підтвердити',
        'discard_order_btn': '❌ Відміна',
    },
}
