DICTIONARY = {
    'ru': {
        'mainmenu_msg': 'Главное меню',

        'my_events_btn': '🔹 Мои события 🔹',
        'settings_btn': 'Настройки ⚙️',
        'settings_menu_msg': 'Здесь ты можешь изменить свой город и подписки на категории',
        'settings_categories_btn': 'Категории️',
        'settings_city_btn': 'Город️',

        'welcome_msg': "Привет, {0}!\nЯ помогу тебе стать специалистом в направлении, которое тебе интересно. "
                       "Ты всегда будешь в курсе новых обучающих онлайн событий.",
        "set_city_msg": "Если не боишься коронавируса, кроме онлайн событий, можешь отслеживать курсы офлайн "
                        "в твоем городе. Введи свой город или нажми Пропустить",
        "signed_up_msg": "Всё готово! Когда появится подходящее для тебя мероприятие, я обязательно сообщу.\n"
                         "Чтобы подписаться на событие, нажми кнопку с его номером.",


        'done_btn': "Готово",
        'skip_btn': 'Пропустить',
        'back_btn': '↩️ Назад',
        'no_button': 'Воспользуйтесь, пожалуйста, клавиатурой',
        'submit_btn': '✅ Подтвердить',
        'discard_order_btn': '❌ Отмена',
    },
}