DICTIONARY = {
    'ru': {
        'mainmenu_msg': 'Главное меню',

        'my_events_btn': '🔹 Мои события 🔹',
        'settings_btn': 'Настройки ⚙️',
        'settings_menu_msg': 'Здесь ты можешь изменить свой город и подписки на категории',
        'settings_categories_btn': 'Категории️',
        'settings_city_btn': 'Город️',
        'remove_city_btn': 'Удалить город️',
        'get_events_btn': 'Список событий',
        'support_btn': 'Поддержка',

        'welcome_msg': "Привет, {0}!\nЯ помогу тебе стать специалистом в направлении, которое тебе интересно. "
                       "Ты всегда будешь в курсе новых обучающих онлайн событий.",
        'set_lang_msg': "Выбери язык:",
        'set_city_msg': "Если не боишься коронавируса, кроме онлайн событий, можешь отслеживать курсы офлайн "
                        "в твоем городе. Введи свой город или нажми Пропустить",
        'signed_up_msg': "🚀 Всё готово! Когда появится подходящее для тебя мероприятие, я обязательно сообщу.\n"
                         "Чтобы подписаться на событие, нажми кнопку с его номером.",

        'subscribe_success_msg': 'Вы успешно подписались на событие! Мы напомним о нем за день до начала.',
        'already_subscribed_msg': 'Вы уже подписались на это событие. Мы напомним о нем за день до начала.',
        'set_categories_msg': "Выбери категории, которые тебе интересны. Нажми Готово, когда закончишь",
        'enter_city_msg': "Введи название города:",
        'saved_city_msg': "Город успешно обновлен",
        'support_menu_msg': 'Если у вас возникли вопросы, отправьте их сюда. Администратор ответит в течении двух дней',
        'sent_support_request_msg': 'Ваш запрос отправлен админу, ожидайте ответа',
        'sent_support_response_msg': 'Ответ отправлен',

        'admin_menu_btn': 'Меню админа',
        'admin_support_menu_msg': 'Чтобы ответить на сообщение от пользователя, нажмите кнопку под ним.',
        'admin_menu_msg': 'Поддержка - ответить на запросы пользователей\n'
                          'Очистить бд - удалить из базы данных все неактуальные события\n'
                          'Добавить админа - добавить админа по его юзернейму\n'
                          'Настройки - редактировать список категорий и городов\n'
                          'Главное меню - вернуться в главное меню',
        'clear_events_btn': 'Очистить бд',
        'clear_events_success_msg': '{0} событий удалено из базы данных',
        'admin_respond_btn': 'Ответить',
        'admin_respond_msg': 'Введите ваш ответ:',
        'send_support_respond_msg': 'Ваш ответ был отправлен пользователю',
        'add_admin_btn': 'Добавить админа',
        'delete_admin_btn': 'Удалить админа',
        'add_admin_msg': 'Введите юзернейм админа:',
        'admin_created_msg': 'Админ успешно создан',
        'admin_exists_msg': 'Этот пользовтель уже является админом',

        'no_city_msg': 'Такого города нет в базе данных. Обратитесь к админу',
        'no_events_msg': 'Вы еще не подписались на событие',
        'unsubscribe_btn': 'Отписаться',
        'empty_events_list_msg': 'Мы не нашли событий по вашим критериям',
        'saved_settings_msg': "Настройки сохранены",

        'see_details_btn': 'Подробнее..',
        'done_btn': "Готово",
        'skip_btn': 'Пропустить',
        'back_btn': '↩️ Назад',
        'no_button': 'Воспользуйтесь, пожалуйста, клавиатурой',
        'submit_btn': '✅ Подтвердить',
        'discard_order_btn': '❌ Отмена',
        'unsubscribed_msg': 'Вы успешно отписались от события'
    },
    'ua': {
        'mainmenu_msg': 'Головне меню',

        'my_events_btn': '🔹 Мої події 🔹',
        'settings_btn': 'Налаштування ⚙️',
        'settings_menu_msg': 'Тут ти можеш змінити своє місто і підписки на категорії',
        'settings_categories_btn': 'Категорії️',
        'settings_city_btn': 'Місто',
        'remove_city_btn': 'Видалити місто',
        'get_events_btn': 'Список подій',
        'support_btn': 'Підтримка',

        'welcome_msg': "Привіт, {0}!\nЯ допоможу тобі стати спеціалістом в сферах, що тебе цікавлять. "
                       "Ти завжди будеш в курсі нових навчальних та професійних подій.",
        'set_lang_msg': "Обери мову:",
        'set_city_msg': "Якщо не боїшся Covid-19, тоді можеш відстежувати і офлайн події у своєму місті."
                        "Введи назву свого міста або натисни Пропустити",
        'signed_up_msg': "🚀 Все готово! Тепер я сповіщатиму тебе про усі події, що можуть тебе зацікавити.\n"
                         "Щоб підписатися на подію, натисни кнопку з його номером.",

        'set_categories_msg': "Обери категорії, що тебе цікавлять. Натисни Готово, щоб зберегти",
        'enter_city_msg': "Введи назву міста:",
        'saved_city_msg': "Місто оновлено",
        'subscribe_success_msg': 'Ви успішно підписалися на подію! Ми нагадаємо про неї за день до початку.',
        'already_subscribed_msg': 'Ви вже підписані на цю подію. Ми нагадаємо про неї за день до початку.',
        'support_menu_msg': 'Якщо у вас виникли питання щодо бота, відправте сюди повідомлення. Адміністратор відповість на нього впродовж двох днів',
        'sent_support_request_msg': 'Ваш запит надісланий адміну, очікуйте відповіді',
        'sent_support_response_msg': 'Відповідь відправлена',

        'unsubscribed_msg': 'Ви успішно відписалися від події',

        'admin_menu_btn': 'Меню адміна',
        'admin_menu_msg': 'Підтримка - відповісти на запити користувачів\n'
                          'Очистити бд - видалити з бази даних всі неактуальні події\n'
                          'Додати адмiна - додати адмiна за його юзернеймом\n'
                          'Налаштування - редагувати список категорій та міст\n'
                          'Головне меню - повернутися до головного меню',

        'admin_support_menu_msg': 'Щоб відповісти на повідомлення від користувача, натисніть кнопку під ним.',
        'clear_events_btn': 'Очистити бд',
        'clear_events_success_msg': '{0} подій видалено з бази даних',
        'admin_respond_btn': 'Відповісти',
        'admin_respond_msg': 'Введiть вашу вiдповiдь:',
        'send_support_respond_msg': 'Відповідь була надіслана користувачу',
        'add_admin_btn': 'Додати адмiна',
        'delete_admin_btn': 'Видалити адмiна',
        'add_admin_msg': 'Введiть юзернейм адмiна:',
        'admin_created_msg': 'Адмiн успiшно створений',
        'admin_exists_msg': 'Цей користувач вже є адмiном',

        'no_city_msg': 'Такого міста немає в базі даних. Зверніться до адміна',
        'no_events_msg': 'Ви ще не підписані на жодну подію',
        'unsubscribe_btn': 'Вiдписатися',
        'empty_events_list_msg': 'Ми не знайшли подій по вашим критеріям',
        'saved_settings_msg': "Налаштування оновлено",

        'see_details_btn': 'Подробиці..',
        'done_btn': "Готово",
        'skip_btn': 'Пропустити',
        'back_btn': '↩️ Назад',
        'no_button': 'Використовуйте клавіатуру, будь-ласка',
        'submit_btn': '✅ Підтвердити',
        'discard_order_btn': '❌ Відміна',
    },

    # universal buttons
    'ua_lang_btn': "🇺🇦 Українська",
    'ru_lang_btn': "🇷🇺 Русский",
}

